{
  "distribution": [
    {
      "name": "Fuse Cutout",
      "cover": "/products/Fuse Cutout Series/C-FCO.png",
      "images": ["/products/Fuse Cutout Series/C-FCO.png"],
      "description": "<p>Drop-out Fuse Cut Out and load switch Fuse Cut Out are outdoor high voltage protective devices, tube connected with incoming feeder of distribution transformer or distribution lines, it mainly protects transformers or lines from short circuits and overloading current.&nbsp;</p><p><br></p><p >It is composed of an insulated insulator support and a fuse tube, static contacts are affixed on two sides of the insulator support and the moving contact is installed on two ends of the fuse tubes. The Fuse tube is composed of an inside arc-extinguishing tube. The Outer phenolic compound paper tube or epoxy glass tube, load switching Fuse Cutout provides enforced elastic auxiliary contacts and arc-extinguishing enclosure switching on-off loading current. All Fuse Cutouts comply according to ANSI Standards.</p>",
      "href": "fuse-cutout"
    },
    {
      "name": "Lightning Arresters",
      "cover": "/products/Lightning Arrester Series/C-LA.png",
      "images": [
        "/products/Lightning Arrester Series/C-LA.png",
        "/products/Lightning Arrester Series/COVER-Lightning Arrester.jpg",
        "/products/Lightning Arrester Series/PELA-10_10.jpg"
      ],
      "description": "Lightning Arrester protects electrical equipment in cases of voltage surges caused by factors like lightning striking overhead power lines, induction lightning in the area of the overhead power lines, switch-on and switch-off operations on the feeder circuit, or a fault in the distribution circuit. With Lightning Arresters, equipment of utility companies and end users are kept from any serious damage.",
      "href": "lightning-arresters"
    },
    {
      "name": "Fuse Link",
      "cover": "/products/Pallas Electrical Fuse Links/C-FL.png",
      "images": ["/products/Pallas Electrical Fuse Links/C-FL.png"],
      "description": "<p ><strong>ACCURATE TIME-CURRENT CHARACTERISTICS</strong></p><p >The fuse element adopts the accurately tested material, high purity silver, or silver-copper eutectic or nickel chrome eutectic, based on different rated current. The fuse element wire is extruded by a mold of high accuracy. The cross section is inspected by laser micrometer to ensure the accuracy, while careful assembly guarantees no crack, shrinkage or twist which affects the time-current accuracy.</p><p><br></p><p ><strong>DURABILITY</strong></p><p >Swaged connected end and high strength strain wire make the fuse link not affected by aging, vibration, or high current impulse which may heat the fuse element nearly to the severing point. When the fuse link in the 1st phase or 2nd phase operates in a three phase circuit, only the melted fuse link needs to be replaced, there will be no need to replace all the fuse links in the circuit.</p><p><br></p><p ><strong>GOOD FAULT INTERRUPTING CAPABILITY</strong></p><p >Can reliably interrupt the inside fault at the first and secondary side of transformer, short-circuit fault of bushing at secondary side of transformer bushing, and short-circuit fault between transformer bushing at transformer secondary side and air switch, so as to protect transformer effectively.</p>",
      "href": "fuse-link"
    },
    {
      "name": "Meter Base",
      "cover": "/products/Meter Mounting Equipment/C-MB.png",
      "images": ["/products/Meter Mounting Equipment/C-MB.png"],
      "description": "PALLAS Electrical meter sockets can be installed in homes with light load current requirements of 100 amps, up to the demanding requirements of the large load currents, requiring a single 320-amp meter socket or multiple meter sockets feeding multiple service panels.",
      "href": "meter-base"
    },
    {
      "name": "Disconnect Switch",
      "cover": "",
      "images": [],
      "description": "<p >The <strong>PALLAS ELECTRICAL DISCONNECT SWITCH </strong>is applied to the power system with AC 50H with a rated voltage of 15kV. It is used to cut off and close single phase or three-phase circuits with no load and voltage. It is composed of the base, pillar insulator, conductive parts, and insurance hook. There is a cutting of and closing circuit by guillotine structure points switching. Each phase has a knife switch and the height of the spring can be adjusted ot get the needed contact pressure. The insulation hook rod can be used to open and close the divide-shut brake. The knife switch itself has a self-locking device.</p><p><br></p><p >The Porcelain Isolate Disconnect Switch is designed to provide reliable isolation and switching performance in a variety of electrical power applications. This switch is an essential component in high-voltage power transmission and distribution systems where it is used to provide a means of disconnecting the power supply for maintenance or repair work. The switch is designed to meet the highest industry standards for safety and performance, and it is manufactured using top-quality materials to ensure reliable operation over a long service life.</p>",
      "href": "disconnect-switch"
    },
    {
      "name": "Insulators",
      "cover": "/products/Insulators/COVER-Insulator 55-5 .webp",
      "images": ["/products/Insulators/COVER-Insulator 55-5 .webp"],
      "description": "<p ><strong>PALLAS PIN TYPE INSULATORS </strong>are designed for use in medium voltage distribution and overhead lines.&nbsp; These are made to withstand harsh weather conditions and exposure to chemicals that may be present in industrial zones. The Pallas Electrical Porcelain Pin Type Insulator is also made to last in thermal, dynamic, and electrical stresses caused by common short circuits, and other operating hazards. These Pallas Insulators are specifically designed to comply with ANSI Class (C29.6) standards, ensuring the performance of both the electrical and mechanical functions, as well as to satisfy all dimensional specifications and applicable requirements.&nbsp;</p><p><br></p><p >Available ANSI Class Insulators:</p><p><br></p><p >ANSI 56-1 Pin Insulator with Gray Color</p><p >ANSI 56-2 Pin Insulator with Gray Color&nbsp;</p><p >ANSI 55-3 Pin Insulator with Gray Color</p><p >ANSI 55-4 Pin Insulator with Gray Color</p><p >ANSI 55-5 Pin Insulator with Gray Color</p><p >ANSI 55-5 Pin Insulator HDPE, 15kV</p><p><br></p><p ><strong>Pallas Electrical Spool Type Insulators </strong>are used together with spool bolt, clevises, and secondary racks for dead-ending or to insulate and support primary neutral and secondary (bare or covered) conductors at the pole or house using various clevis mounting variations to maximize its effectiveness. Pallas Electrical Spool insulators are manufactured to meet ANSI Specification C29.5 and ANSI C29.3</p><p><br></p><p >Available ANSI Class Insulators:</p><p><br></p><p >ANSI 53-2 Porcelain Spool Insulator Brown Color</p><p >ANSI 53-4 Spool Insulator Brown Color</p>",
      "href": "insulator"
    },
    {
      "name": "Fuse Tube",
      "cover": "/products/Fuse Cutout Series/COVER-FUSE TUBE.png",
      "images": ["/products/Fuse Cutout Series/COVER-FUSE TUBE.png"],
      "description": "<p ><strong>PALLAS ELECTRICAL FUSE TUBES (PEFT) </strong>top of the line Fuse Holders compatible with all our Pallas Electrical Fuse cutouts, these are used in supporting the protection of&nbsp; the distribution line from over current and short-circuit. PEFTs are made of epoxy glass fiber lined with uv resistant coating and copper arc-extinguishing material, the fuse tube does not absorb moisture or deform. PEFTs are designed to accommodate the standard expulsion fuse link Type K or Type T. Moreover, with strong <strong>UV </strong>resistance, thick arc-extinguishing layer and good arc-extinguishing performance, it has a long service life. In addition, the upper part of the fuse tube can prevent water intrusion, so as to ensure no water in the fuse tube. Our PEFTs can also be ordered with <strong>Arc-shortening rods</strong>, upon request.</p><p >&nbsp;</p><p >The fuse carrier adopts single exhaust (downward) with a solid cap to avoid the threat of free gas to the circuit, unnecessary mechanical damage or short circuit. At the same time, the performance of short-circuit current and interruption of the fuse can be greatly improved.</p><p><br></p><p >Available:</p><p><br></p><p >Pallas Electrical Fuse Tube 100A</p><p >Pallas Electrical Fuse Tube 200A</p>",
      "href": "fuse-tube"
    }
  ],
  "transmission": [
    {
      "name": "69KV Transmission Products",
      "cover": "",
      "images": [],
      "description": "Lightning Arrester protects electrical equipment in cases of voltage surges caused by factors like lightning striking overhead power lines, induction lightning in the area of the overhead power lines, switch-on and switch-off operations on the feeder circuit, or a fault in the distribution circuit. With Lightning Arresters, equipment of utility companies and end users are kept from any serious damage.",
      "href": "lightning-arresters"
    },
    {
      "name": "110KV Transmission Products",
      "cover": "",
      "images": [],
      "description": "Lightning Arrester protects electrical equipment in cases of voltage surges caused by factors like lightning striking overhead power lines, induction lightning in the area of the overhead power lines, switch-on and switch-off operations on the feeder circuit, or a fault in the distribution circuit. With Lightning Arresters, equipment of utility companies and end users are kept from any serious damage.",
      "href": "lightning-arresters"
    },
    {
      "name": "250KV Transmission Products",
      "cover": "",
      "images": [],
      "description": "Lightning Arrester protects electrical equipment in cases of voltage surges caused by factors like lightning striking overhead power lines, induction lightning in the area of the overhead power lines, switch-on and switch-off operations on the feeder circuit, or a fault in the distribution circuit. With Lightning Arresters, equipment of utility companies and end users are kept from any serious damage.",
      "href": "lightning-arresters"
    }
  ]
}
